// ============================================================================
// 题号: 7
// 题目: Reverse Integer
// 难度: Medium
// 分类: Math
// 链接: https://leetcode.cn/problems/reverse-integer/
// 拉取日期: 2026-07-26
// ============================================================================

// ============================================================================
// 题目描述(中文)
// ============================================================================
// 给你一个 32 位的有符号整数 x ，返回将 x 中的数字部分反转后的结果。
//
// 如果反转后整数超过 32 位的有符号整数的范围 [−231,  231 − 1] ，就返回 0。
//
// 假设环境不允许存储 64 位整数（有符号或无符号）。
//
// 示例 1：
//
// 输入：x = 123
// 输出：321
//
// 示例 2：
//
// 输入：x = -123
// 输出：-321
//
// 示例 3：
//
// 输入：x = 120
// 输出：21
//
// 示例 4：
//
// 输入：x = 0
// 输出：0
//
// 提示：
//
// -231 <= x <= 231 - 1
// ============================================================================

// ============================================================================
// 题目描述(英文)
// ============================================================================
// Given a signed 32-bit integer x, return x with its digits reversed. If reversing x causes the value to go outside the signed 32-bit integer range [-231, 231 - 1], then return 0.
//
// Assume the environment does not allow you to store 64-bit integers (signed or unsigned).
//
// Example 1:
//
// Input: x = 123
// Output: 321
//
// Example 2:
//
// Input: x = -123
// Output: -321
//
// Example 3:
//
// Input: x = 120
// Output: 21
//
// Constraints:
//
// -231 <= x <= 231 - 1
// ============================================================================

package leetcode

func reverse(x int) int {
    
}
